0_data_les/cervi/test1_sst_simpleFoam_qs/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application          simpleFoam;
startFrom            latestTime;
startTime            0;
stopAt               endTime;
endTime              20000;
deltaT               1;
writeControl         timeStep;
writeInterval        2000;
purgeWrite           0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //


functions
{
    yPlus
    {
        type            yPlus;
        libs            ("fieldFunctionObjects");
        executeControl  writeTime;
writeControl         timeStep;
    }

    wallShearStress
    {
        type            wallShearStress;
        libs            ("fieldFunctionObjects");
        executeControl  writeTime;
writeControl         timeStep;
    }
}
