0_data_les/cervi/test1_sst_simpleFoam_qs/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       92240;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       92280;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          92800;
        startFace       92320;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1040;
        startFace       185120;
    }
)

// ************************************************************************* //
