0_data_les/cervi/test1_sst_simpleFoam_qs/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
46400
(
(0.00290708461 -0.002812358393 0)
(0.002903551067 -0.002795358429 0)
(0.002900169906 -0.002777783486 0)
(0.002897082321 -0.002759770774 0)
(0.00289448383 -0.002741516505 0)
(0.00289264019 -0.002723288267 0)
(0.002891905069 -0.002705435445 0)
(0.00289273718 -0.002688393619 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0.05 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            noSlip;
    }
}


// ************************************************************************* //
