0_data_les/cervi/test1_sst_simpleFoam_qs/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
46400
(
2.101550414e-05
2.096194355e-05
2.090686001e-05
2.085080542e-05
2.079456221e-05
2.073919649e-05
2.068610737e-05
2.063705799e-05
...
)
;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 9.375e-06;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
1040
(
1.777284645e-05
1.777284645e-05
1.777284645e-05
1.777284645e-05
1.777284645e-05
1.777284645e-05
1.777284645e-05
1.777284645e-05
...
)
;
    }
}


// ************************************************************************* //
