0_data_les/cervi/test1_sst_simpleFoam_qs/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
46400
(
2.525632659e-05
2.522524457e-05
2.519329101e-05
2.516079127e-05
2.512820637e-05
2.509616448e-05
2.506549016e-05
2.50372232e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
2.907190896e-06
2.907190896e-06
2.907190896e-06
2.907190896e-06
2.907190896e-06
2.907190896e-06
2.907190896e-06
2.907190896e-06
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
3.804801139e-05
3.804801139e-05
3.804801139e-05
3.804801139e-05
3.804801139e-05
3.804801139e-05
3.804801139e-05
3.804801139e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
1040
(
2.287496068e-06
2.287496068e-06
2.287496068e-06
2.287496068e-06
2.287496068e-06
2.287496068e-06
2.287496068e-06
2.287496068e-06
...
)
;
    }
}


// ************************************************************************* //
