0_data_les/cervi/test1_sst_simpleFoam_qs/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}

numberOfSubdomains 32;

method          simple;

simpleCoeffs
{
    n               (8 4 1);
    delta           0.001;
}

distributed     no;

roots           ();
